app/controllers/registrations_controller.rb

	def create
		user = User.create(registrations_params)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)