app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "baperez@miuandes.cl"], ["LIMIT", 1]]
---
	def create
		user = User.find_by_email(session_params[:email])