app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "benjamon"], ["updated_at", "2018-04-17 22:43:51.708056"], ["id", 1]]
---
  def update
    user = User.find_by_id(session[:current_user_id])
    user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def destroy
    user = User.find_by_id(params[:id])
    user.destroy